#include "xtl.h"

#pragma warning(disable : 4480)

namespace mp
{

    /* 9096 */
    struct EntHandle
    {
        unsigned __int16 number;
        unsigned __int16 infoIndex;
    };

    /* 9097 */
    struct entityShared_t
    {
        unsigned __int8 linked;
        unsigned __int8 bmodel;
        unsigned __int8 svFlags;
        int clientMask[2];
        unsigned __int8 inuse;
        int broadcastTime;
        float mins[3];
        float maxs[3];
        int contents;
        float absmin[3];
        float absmax[3];
        float currentOrigin[3];
        float currentAngles[3];
        EntHandle ownerNum;
        int eventTime;
    };

    static_assert(sizeof(entityShared_t) == 0x0068, "");

    /* 662 */
    enum OffhandSecondaryClass : __int32
    {
        PLAYER_OFFHAND_SECONDARY_SMOKE = 0x0,
        PLAYER_OFFHAND_SECONDARY_FLASH = 0x1,
        PLAYER_OFFHAND_SECONDARIES_TOTAL = 0x2,
    };

    /* 663 */
    enum ViewLockTypes : __int32
    {
        PLAYERVIEWLOCK_NONE = 0x0,
        PLAYERVIEWLOCK_FULL = 0x1,
        PLAYERVIEWLOCK_WEAPONJITTER = 0x2,
        PLAYERVIEWLOCKCOUNT = 0x3,
    };

    /* 665 */
    enum team_t : __int32
    {
        TEAM_FREE = 0x0,
        TEAM_AXIS = 0x1,
        TEAM_ALLIES = 0x2,
        TEAM_SPECTATOR = 0x3,
        TEAM_NUM_TEAMS = 0x4,
    };

    /* 8733 */
    struct SprintState
    {
        int sprintButtonUpRequired;
        int sprintDelay;
        int lastSprintStart;
        int lastSprintEnd;
        int sprintStartMaxLength;
    };

    /* 8734 */
    struct MantleState
    {
        float yaw;
        int timer;
        int transIndex;
        int flags;
    };

    /* 664 */
    enum ActionSlotType : __int32
    {
        ACTIONSLOTTYPE_DONOTHING = 0x0,
        ACTIONSLOTTYPE_SPECIFYWEAPON = 0x1,
        ACTIONSLOTTYPE_ALTWEAPONTOGGLE = 0x2,
        ACTIONSLOTTYPE_NIGHTVISION = 0x3,
        ACTIONSLOTTYPECOUNT = 0x4,
    };

    /* 8721 */
    struct ActionSlotParam_SpecifyWeapon
    {
        unsigned int index;
    };

    /* 8735 */
    struct ActionSlotParam
    {
        ActionSlotParam_SpecifyWeapon specifyWeapon;
    };

    /* 660 */
    enum objectiveState_t : __int32
    {
        OBJST_EMPTY = 0x0,
        OBJST_ACTIVE = 0x1,
        OBJST_INVISIBLE = 0x2,
        OBJST_DONE = 0x3,
        OBJST_CURRENT = 0x4,
        OBJST_FAILED = 0x5,
        OBJST_NUMSTATES = 0x6,
    };

    /* 8736 */
    struct objective_t
    {
        objectiveState_t state;
        float origin[3];
        int entNum;
        int teamNum;
        int icon;
    };

    /* 667 */
    enum he_type_t : __int32
    {
        HE_TYPE_FREE = 0x0,
        HE_TYPE_TEXT = 0x1,
        HE_TYPE_VALUE = 0x2,
        HE_TYPE_PLAYERNAME = 0x3,
        HE_TYPE_MAPNAME = 0x4,
        HE_TYPE_GAMETYPE = 0x5,
        HE_TYPE_MATERIAL = 0x6,
        HE_TYPE_TIMER_DOWN = 0x7,
        HE_TYPE_TIMER_UP = 0x8,
        HE_TYPE_TENTHS_TIMER_DOWN = 0x9,
        HE_TYPE_TENTHS_TIMER_UP = 0xA,
        HE_TYPE_CLOCK_DOWN = 0xB,
        HE_TYPE_CLOCK_UP = 0xC,
        HE_TYPE_WAYPOINT = 0xD,
        HE_TYPE_COUNT = 0xE,
    };

    /* 8713 */
    struct $0D0CB43DF22755AD856C77DD3F304010
    {
        unsigned __int8 r;
        unsigned __int8 g;
        unsigned __int8 b;
        unsigned __int8 a;
    };

    /* 8714 */
    union hudelem_color_t
    {
        $0D0CB43DF22755AD856C77DD3F304010 __s0;
        int rgba;
    };

    /* 8737 */
    struct hudelem_s
    {
        he_type_t type;
        float x;
        float y;
        float z;
        int targetEntNum;
        float fontScale;
        int font;
        int alignOrg;
        int alignScreen;
        hudelem_color_t color;
        hudelem_color_t fromColor;
        int fadeStartTime;
        int fadeTime;
        int label;
        int width;
        int height;
        int materialIndex;
        int offscreenMaterialIdx;
        int fromWidth;
        int fromHeight;
        int scaleStartTime;
        int scaleTime;
        float fromX;
        float fromY;
        int fromAlignOrg;
        int fromAlignScreen;
        int moveStartTime;
        int moveTime;
        int time;
        int duration;
        float value;
        int text;
        float sort;
        hudelem_color_t glowColor;
        int fxBirthTime;
        int fxLetterTime;
        int fxDecayStartTime;
        int fxDecayDuration;
        int soundID;
        int flags;
    };

    struct hudElemState_t
    {
        hudelem_s current[31];
        hudelem_s archival[31];
    };

    struct playerState_s
    {
        int commandTime; // 0
        int pm_type;     // 4
        int bobCycle;    // 8
        int pm_flags;    // 12
        int weapFlags;
        int otherFlags;
        int pm_time;
        float origin[3];
        float velocity[3]; // 40
        float oldVelocity[2];
        int weaponTime;
        int weaponDelay;
        int grenadeTimeLeft;
        int throwBackGrenadeOwner;
        int throwBackGrenadeTimeLeft;
        int weaponRestrictKickTime;
        int foliageSoundTime;
        int gravity;
        float leanf;
        int speed;
        float delta_angles[3];
        int groundEntityNum; // 112
        float vLadderVec[3];
        int jumpTime;
        float jumpOriginZ; // 132
        int legsTimer;     // 136
        int legsAnim;      // 140
        int torsoTimer;    // 144
        int torsoAnim;
        int legsAnimDuration;
        int torsoAnimDuration;
        int damageTimer;
        int damageDuration;
        int flinchYawAnim; // 168
        char _pad[4];      // 172
        int movementDir;   // 176
        int eFlags;        // 180
        int eventSequence;
        int events[4];
        unsigned int eventParms[4];
        int oldEventSequence;
        int clientNum;
        int offHandIndex;
        OffhandSecondaryClass offhandSecondary;
        unsigned int weapon;
        int weaponstate; // 240
        unsigned int weaponShotCount;
        float fWeaponPosFrac;
        int adsDelayTime;
        int spreadOverride;
        int spreadOverrideState;
        int viewmodelIndex;
        float viewangles[3]; // 268
        int viewHeightTarget;
        float viewHeightCurrent;
        int viewHeightLerpTime;
        int viewHeightLerpTarget;
        int viewHeightLerpDown;
        float viewAngleClampBase[2];
        float viewAngleClampRange[2];
        int damageEvent;
        int damageYaw;
        int damagePitch;
        int damageCount;
        int stats[5];
        int ammo[128];
        int ammoclip[128];
        unsigned int weapons[4];
        unsigned int weaponold[4];
        unsigned int weaponrechamber[4];
        float proneDirection;
        float proneDirectionPitch;
        float proneTorsoPitch;
        ViewLockTypes viewlocked;
        int viewlocked_entNum;
        int cursorHint;
        int cursorHintString;
        int cursorHintEntIndex;
        int iCompassPlayerInfo;
        int radarEnabled;
        int locationSelectionInfo;
        SprintState sprintState;
        float fTorsoPitch;
        float fWaistPitch;
        float holdBreathScale;
        int holdBreathTimer;
        float moveSpeedScaleMultiplier;
        MantleState mantleState;
        float meleeChargeYaw;
        int meleeChargeDist;
        int meleeChargeTime;
        int perks;
        ActionSlotType actionSlotType[4];
        ActionSlotParam actionSlotParam[4];
        int entityEventSequence;
        int weapAnim;
        float aimSpreadScale;
        int shellshockIndex;
        int shellshockTime;
        int shellshockDuration;
        float dofNearStart;
        float dofNearEnd;
        float dofFarStart;
        float dofFarEnd;
        float dofNearBlur;
        float dofFarBlur;
        float dofViewmodelStart;
        float dofViewmodelEnd;
        int hudElemLastAssignedSoundID;
        objective_t objective[16];
        unsigned __int8 weaponmodels[128];
        int deltaTime;
        int killCamEntity;
        hudElemState_t hud;
    };

    static_assert(offsetof(playerState_s, velocity) == 40, "");
    static_assert(offsetof(playerState_s, groundEntityNum) == 112, "");
    static_assert(offsetof(playerState_s, jumpOriginZ) == 132, "");
    static_assert(offsetof(playerState_s, legsTimer) == 136, "");
    static_assert(offsetof(playerState_s, torsoTimer) == 144, "");
    static_assert(offsetof(playerState_s, flinchYawAnim) == 168, "");
    static_assert(offsetof(playerState_s, movementDir) == 176, "");
    static_assert(offsetof(playerState_s, eFlags) == 180, "");
    static_assert(offsetof(playerState_s, weaponstate) == 240, "");
    static_assert(offsetof(playerState_s, viewangles) == 268, "");

    struct playerTeamState_t
    {
        int location;
    };

    /* 8741 */
    struct clientState_s
    {
        int clientIndex;
        team_t team;
        int modelindex;
        int attachModelIndex[6];
        int attachTagIndex[6];
        char name[32];
        float maxSprintTimeMultiplier;
        int rank;
        int prestige;
        int perks;
        int voiceConnectivityBits;
        char clanAbbrev[8];
        int attachedVehEntNum;
        int attachedVehSlotIndex;
    };

    /* 770 */
    enum clientConnected_t : __int32
    {
        CON_DISCONNECTED = 0x0,
        CON_CONNECTING = 0x1,
        CON_CONNECTED = 0x2,
    };

    /* 771 */
    enum sessionState_t : __int32
    {
        SESS_STATE_PLAYING = 0x0,
        SESS_STATE_DEAD = 0x1,
        SESS_STATE_SPECTATOR = 0x2,
        SESS_STATE_INTERMISSION = 0x3,
    };

    /* 8748 */
    struct __declspec(align(2)) usercmd_s
    {
        int serverTime;
        int buttons;
        int angles[3];
        unsigned __int8 weapon;
        unsigned __int8 offHandIndex;
        char forwardmove;
        char rightmove;
        float meleeChargeYaw;
        unsigned __int8 meleeChargeDist;
        char selectedLocation[2];
    };

    static_assert(sizeof(usercmd_s) == 0x0020, "");

    /* 9100 */
    struct clientSession_t
    {
        sessionState_t sessionState; // correct
        int forceSpectatorClient;
        int killCamEntity;
        int status_icon;
        int archiveTime;
        int score;
        int deaths;
        int kills;
        int assists;
        unsigned __int16 scriptPersId;
        clientConnected_t connected;
        usercmd_s cmd;
        usercmd_s oldcmd;
        int localClient;
        int predictItemPickup;
        char newnetname[32];
        int maxHealth;
        int enterTime;
        playerTeamState_t teamState;
        int voteCount;
        int teamVoteCount;
        float moveSpeedScaleMultiplier;
        int viewmodelIndex;
        int noSpectate;
        int teamInfo;
        clientState_s cs;
        int psOffsetTime;
    };

    struct gentity_s;

    struct gclient_s
    {
        playerState_s ps;
        clientSession_t sess;
        int spectatorClient;
        int noclip; // 0x30a8
        int ufo;    // 0x30ac
        int bFrozen;
        int lastCmdTime;
        int buttons;
        int oldbuttons;
        int latched_buttons;
        int buttonsSinceLastFrame;
        float oldOrigin[3];
        float fGunPitch;
        float fGunYaw;
        int damage_blood;
        float damage_from[3];
        int damage_fromWorld;
        int accurateCount;
        int accuracy_shots;
        int accuracy_hits;
        int inactivityTime;
        int inactivityWarning;
        int lastVoiceTime;
        int switchTeamTime;
        float currentAimSpreadScale;
        gentity_s *persistantPowerup;
        int portalID;
        int dropWeaponTime;
        int sniperRifleFiredTime;
        float sniperRifleMuzzleYaw;
        int PCSpecialPickedUpCount;
        EntHandle useHoldEntity;
        int useHoldTime;
        int useButtonDone;
        int iLastCompassPlayerInfoEnt;
        int compassPingTime;
        int damageTime;
        float v_dmg_roll;
        float v_dmg_pitch;
        float swayViewAngles[3];
        float swayOffset[3];
        float swayAngles[3];
        float vLastMoveAng[3];
        float fLastIdleFactor;
        float vGunOffset[3];
        float vGunSpeed[3];
        int weapIdleTime;
        int lastServerTime;
        int lastSpawnTime;
        unsigned int lastWeapon;
        bool previouslyFiring;
        bool previouslyUsingNightVision;
        bool previouslySprinting;
        int hasRadar;
        int lastStand;
        int lastStandTime;
    };

    static_assert(offsetof(gclient_s, noclip) == 0x30a8, "");
    static_assert(offsetof(gclient_s, ufo) == 0x30ac, "");
    static_assert(sizeof(gclient_s) == 12724, "");

    static_assert(offsetof(gclient_s, sess) + offsetof(clientSession_t, cmd) == 12180, "");
    static_assert(offsetof(gclient_s, sess) + offsetof(clientSession_t, archiveTime) == 12152, "");

    struct LerpEntityStatePhysicsJitter
    {
        float innerRadius;
        float minDisplacement;
        float maxDisplacement;
    };

    struct LerpEntityStatePlayer
    {
        float leanf;
        int movementDir;
    };

    struct LerpEntityStateLoopFx
    {
        float cullDist;
        int period;
    };

    struct LerpEntityStateCustomExplode
    {
        int startTime;
    };

    struct LerpEntityStateTurret
    {
        float gunAngles[3];
    };

    struct LerpEntityStateAnonymous
    {
        int data[7];
    };

    struct LerpEntityStateExplosion
    {
        float innerRadius;
        float magnitude;
    };

    struct LerpEntityStateBulletHit
    {
        float start[3];
    };

    struct LerpEntityStatePrimaryLight
    {
        byte colorAndExp[4];
        float intensity;
        float radius;
        float cosHalfFovOuter;
        float cosHalfFovInner;
    };

    struct LerpEntityStateMissile
    {
        int launchTime;
    };

    struct LerpEntityStateSoundBlend
    {
        float lerp;
    };

    struct LerpEntityStateExplosionJolt
    {
        float innerRadius;
        float impulse[3];
    };

    struct LerpEntityStateVehicle
    {
        float bodyPitch;
        float bodyRoll;
        float steerYaw;
        int materialTime;
        float gunPitch;
        float gunYaw;
        int team;
    };

    struct LerpEntityStateEarthquake
    {
        float scale;
        float radius;
        int duration;
    };

    /* 678 */
    enum trType_t : __int32
    {
        TR_STATIONARY = 0x0,
        TR_INTERPOLATE = 0x1,
        TR_LINEAR = 0x2,
        TR_LINEAR_STOP = 0x3,
        TR_SINE = 0x4,
        TR_GRAVITY = 0x5,
        TR_ACCELERATE = 0x6,
        TR_DECELERATE = 0x7,
        TR_PHYSICS = 0x8,
        TR_FIRST_RAGDOLL = 0x9,
        TR_RAGDOLL = 0x9,
        TR_RAGDOLL_GRAVITY = 0xA,
        TR_RAGDOLL_INTERPOLATE = 0xB,
        TR_LAST_RAGDOLL = 0xB,
    };

    /* 8750 */
    struct trajectory_t
    {
        trType_t trType;
        int trTime;
        int trDuration;
        float trBase[3];
        float trDelta[3];
    };

    /* 8743 */
    union LerpEntityStateTypeUnion
    {
        LerpEntityStateTurret turret;
        LerpEntityStateLoopFx loopFx;
        LerpEntityStatePrimaryLight primaryLight;
        LerpEntityStatePlayer player;
        LerpEntityStateVehicle vehicle;
        LerpEntityStateMissile missile;
        LerpEntityStateSoundBlend soundBlend;
        LerpEntityStateBulletHit bulletHit;
        LerpEntityStateEarthquake earthquake;
        LerpEntityStateCustomExplode customExplode;
        LerpEntityStateExplosion explosion;
        LerpEntityStateExplosionJolt explosionJolt;
        LerpEntityStatePhysicsJitter physicsJitter;
        LerpEntityStateAnonymous anonymous;
    };

    /* 8751 */
    struct LerpEntityState
    {
        int eFlags;
        trajectory_t pos;
        trajectory_t apos;
        LerpEntityStateTypeUnion u;
    };

    struct entityState_s
    {
        int number; // entity index	//0x00
        int eType;  // entityType_t	//0x04

        LerpEntityState lerp;

        int time2; // 0x70

        int otherEntityNum;    // 0x74 shotgun sources, etc
        int attackerEntityNum; // 0x78

        int groundEntityNum; // 0x7c -1 = in air

        int loopSound; // 0x80 constantly loop this sound
        int surfType;  // 0x84

        int index;         // 0x88
        int clientNum;     // 0x8c 0 to (MAX_CLIENTS - 1), for players and corpses
        int iHeadIcon;     // 0x90
        int iHeadIconTeam; // 0x94

        int solid; // 0x98 for client side prediction, trap_linkentity sets this properly	0x98

        int eventParm;     // 0x9c impulse events -- muzzle flashes, footsteps, etc
        int eventSequence; // 0xa0

        int events[4];     // 0xa4
        int eventParms[4]; // 0xb4

        // for players
        int weapon;      // 0xc4 determines weapon and flash model, etc
        int weaponModel; // 0xc8
        int legsAnim;    // 0xcc mask off ANIM_TOGGLEBIT
        int torsoAnim;   // 0xd0 mask off ANIM_TOGGLEBIT

        union
        {
            int helicopterStage; // 0xd4
        } un1;

        int un2;                  // 0xd8
        int fTorsoPitch;          // 0xdc
        int fWaistPitch;          // 0xe0
        unsigned int partBits[4]; // 0xe4
    };

    static_assert(sizeof(entityState_s) == 0xf4, "");
    static_assert(offsetof(entityState_s, index) == 0x88, "");

    struct turretInfo_s;
    struct scr_vehicle_s;

    struct item_ent_t
    {
        int ammoCount;
        int clipAmmoCount;
        int index;
    };

    struct __declspec(align(4)) trigger_ent_t
    {
        int threshold;
        int accumulate;
        int timestamp;
        int singleUserEntIndex;
        bool requireLookAt;
    };

    struct mover_ent_t
    {
        float decelTime;
        float aDecelTime;
        float speed;
        float aSpeed;
        float midTime;
        float aMidTime;
        float pos1[3];
        float pos2[3];
        float pos3[3];
        float apos1[3];
        float apos2[3];
        float apos3[3];
    };

    struct corpse_ent_t
    {
        int deathAnimStartTime;
    };

    enum MissileStage : __int32
    {
        MISSILESTAGE_SOFTLAUNCH = 0x0,
